{"format": "layers-model", "generatedBy": "keras v2.5.0", "convertedBy": "TensorFlow.js Converter v3.8.0", "modelTopology": {"keras_version": "2.5.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "model", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 15, 59, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_l"}, "name": "input_l", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 15, 59, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_r"}, "name": "input_r", "inbound_nodes": []}, {"class_name": "Sequential", "config": {"name": "embedder", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 15, 59, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "conv1d_input"}}, {"class_name": "Conv1D", "config": {"name": "conv1d", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Conv1D", "config": {"name": "conv1d_1", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Conv1D", "config": {"name": "conv1d_2", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "TimeDistributed", "config": {"name": "time_distributed", "trainable": true, "dtype": "float32", "layer": {"class_name": "Flatten", "config": {"name": "flatten", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}}}, {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 4096, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "LSTM", "config": {"name": "lstm", "trainable": true, "batch_input_shape": [null, 15, 4096], "dtype": "float32", "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 1028, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}, "shared_object_id": 17}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}, "shared_object_id": 18}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 19}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.5, "recurrent_dropout": 0.0, "implementation": 2}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 610, "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}, "name": "embedder", "inbound_nodes": [[["input_l", 0, 0, {}]], [["input_r", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "euclidean_dist", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAABAAAAAcAAABTAAAAc0QAAAB8AFwCfQF9AnQAagFqAnQAagGgA3wBfAIYAKEBZAFk\nAmQDjQN9A3QAagGgBHQAagGgBXwDdABqBmoHoAihAKECoQFTACkETukBAAAAVCkC2gRheGlz2ghr\nZWVwZGltcykJ2gJ0ZtoEbWF0aNoKcmVkdWNlX3N1bdoGc3F1YXJl2gRzcXJ02gdtYXhpbXVt2gVr\nZXJhc9oHYmFja2VuZNoHZXBzaWxvbikEWgV2ZWN0c9oBeNoBeVoKc3VtX3NxdWFyZakAcg8AAAD6\nHzxpcHl0aG9uLWlucHV0LTIwLTA4NDZlN2M4MTdlNz7aEmV1Y2xpZGVhbl9kaXN0YW5jZQIAAABz\nBgAAAAABCAEeAQ==\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "euclidean_dist", "inbound_nodes": [[["embedder", 1, 0, {}], ["embedder", 2, 0, {}]]]}], "input_layers": [["input_l", 0, 0], ["input_r", 0, 0]], "output_layers": [["euclidean_dist", 0, 0]]}}, "training_config": {"loss": "contrastive_loss", "metrics": [[{"class_name": "MeanMetricWrapper", "config": {"name": "accuracy", "dtype": "float32", "fn": "accuracy"}}]], "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "Adam", "config": {"name": "Adam", "learning_rate": 0.0005000000237487257, "decay": 0.0, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of48.bin", "group1-shard2of48.bin", "group1-shard3of48.bin", "group1-shard4of48.bin", "group1-shard5of48.bin", "group1-shard6of48.bin", "group1-shard7of48.bin", "group1-shard8of48.bin", "group1-shard9of48.bin", "group1-shard10of48.bin", "group1-shard11of48.bin", "group1-shard12of48.bin", "group1-shard13of48.bin", "group1-shard14of48.bin", "group1-shard15of48.bin", "group1-shard16of48.bin", "group1-shard17of48.bin", "group1-shard18of48.bin", "group1-shard19of48.bin", "group1-shard20of48.bin", "group1-shard21of48.bin", "group1-shard22of48.bin", "group1-shard23of48.bin", "group1-shard24of48.bin", "group1-shard25of48.bin", "group1-shard26of48.bin", "group1-shard27of48.bin", "group1-shard28of48.bin", "group1-shard29of48.bin", "group1-shard30of48.bin", "group1-shard31of48.bin", "group1-shard32of48.bin", "group1-shard33of48.bin", "group1-shard34of48.bin", "group1-shard35of48.bin", "group1-shard36of48.bin", "group1-shard37of48.bin", "group1-shard38of48.bin", "group1-shard39of48.bin", "group1-shard40of48.bin", "group1-shard41of48.bin", "group1-shard42of48.bin", "group1-shard43of48.bin", "group1-shard44of48.bin", "group1-shard45of48.bin", "group1-shard46of48.bin", "group1-shard47of48.bin", "group1-shard48of48.bin"], "weights": [{"name": "conv1d/kernel", "shape": [3, 3, 32], "dtype": "float32"}, {"name": "conv1d/bias", "shape": [32], "dtype": "float32"}, {"name": "conv1d_1/kernel", "shape": [3, 32, 64], "dtype": "float32"}, {"name": "conv1d_1/bias", "shape": [64], "dtype": "float32"}, {"name": "conv1d_2/kernel", "shape": [3, 64, 128], "dtype": "float32"}, {"name": "conv1d_2/bias", "shape": [128], "dtype": "float32"}, {"name": "dense/kernel", "shape": [6784, 4096], "dtype": "float32"}, {"name": "dense/bias", "shape": [4096], "dtype": "float32"}, {"name": "lstm/lstm_cell/kernel", "shape": [4096, 4112], "dtype": "float32"}, {"name": "lstm/lstm_cell/recurrent_kernel", "shape": [1028, 4112], "dtype": "float32"}, {"name": "lstm/lstm_cell/bias", "shape": [4112], "dtype": "float32"}, {"name": "dense_1/kernel", "shape": [1028, 610], "dtype": "float32"}, {"name": "dense_1/bias", "shape": [610], "dtype": "float32"}]}]}